In [ ]:
from google.colab import files
files.upload()

In [2]:
import pandas as pd

In [3]:
data = pd.read_csv('/content/homelessness.csv')
data.head()

   Unnamed: 0              region  ... family_members  state_pop
0           0  East South Central  ...          864.0    4887681
1           1             Pacific  ...          582.0     735139
2           2            Mountain  ...         2606.0    7158024
3           3  West South Central  ...          432.0    3009733
4           4             Pacific  ...        20964.0   39461588

[5 rows x 6 columns]

In [7]:
data.tail()

                region          state  individuals  family_members  state_pop
46      South Atlantic       Virginia       3928.0          2047.0    8501286
47             Pacific     Washington      16424.0          5880.0    7523869
48      South Atlantic  West Virginia       1021.0           222.0    1804291
49  East North Central      Wisconsin       2740.0          2167.0    5807406
50            Mountain        Wyoming        434.0           205.0     577601

In [8]:
data.head(2)

               region    state  individuals  family_members  state_pop
0  East South Central  Alabama       2570.0           864.0    4887681
1             Pacific   Alaska       1434.0           582.0     735139

In [9]:
data.tail(2)

                region      state  individuals  family_members  state_pop
49  East North Central  Wisconsin       2740.0          2167.0    5807406
50            Mountain    Wyoming        434.0           205.0     577601

In [4]:
data.shape

(51, 6)

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      51 non-null     int64
 1   region          51 non-null     object
 2   state           51 non-null     object
 3   individuals     51 non-null     float64
 4   family_members  51 non-null     float64
 5   state_pop       51 non-null     int64
dtypes: float64(2), int64(2), object(2)
memory usage: 2.5+ KB

In [6]:
data.drop('Unnamed: 0',1,inplace=True)

In [10]:
data.describe()

         individuals  family_members     state_pop
count      51.000000       51.000000  5.100000e+01
mean     7225.784314     3504.882353  6.405637e+06
std     15991.025083     7805.411811  7.327258e+06
min       434.000000       75.000000  5.776010e+05
25%      1446.500000      592.000000  1.777414e+06
50%      3082.000000     1482.000000  4.461153e+06
75%      6781.500000     3196.000000  7.340946e+06
max    109008.000000    52070.000000  3.946159e+07

In [11]:
data.describe(include='all')

                region    state    individuals  family_members     state_pop
count               51       51      51.000000       51.000000  5.100000e+01
unique               9       51            NaN             NaN           NaN
top     South Atlantic  Wyoming            NaN             NaN           NaN
freq                 9        1            NaN             NaN           NaN
mean               NaN      NaN    7225.784314     3504.882353  6.405637e+06
std                NaN      NaN   15991.025083     7805.411811  7.327258e+06
min                NaN      NaN     434.000000       75.000000  5.776010e+05
25%                NaN      NaN    1446.500000      592.000000  1.777414e+06
50%                NaN      NaN    3082.000000     1482.000000  4.461153e+06
75%                NaN      NaN    6781.500000     3196.000000  7.340946e+06
max                NaN      NaN  109008.000000    52070.000000  3.946159e+07

In [12]:
data.dtypes

region             object
state              object
individuals       float64
family_members    float64
state_pop           int64
dtype: object

In [14]:
data.select_dtypes('int').columns

Index(['state_pop'], dtype='object')

In [15]:
data.index

RangeIndex(start=0, stop=51, step=1)

In [16]:
data.columns

Index(['region', 'state', 'individuals', 'family_members', 'state_pop'], dtype='object')

In [17]:
data.values[:5]

array([['East South Central', 'Alabama', 2570.0, 864.0, 4887681],
       ['Pacific', 'Alaska', 1434.0, 582.0, 735139],
       ['Mountain', 'Arizona', 7259.0, 2606.0, 7158024],
       ['West South Central', 'Arkansas', 2280.0, 432.0, 3009733],
       ['Pacific', 'California', 109008.0, 20964.0, 39461588]],
      dtype=object)

In [18]:
data['state'].head()

0       Alabama
1        Alaska
2       Arizona
3      Arkansas
4    California
Name: state, dtype: object

In [19]:
data[['state','region']].head()

        state              region
0     Alabama  East South Central
1      Alaska             Pacific
2     Arizona            Mountain
3    Arkansas  West South Central
4  California             Pacific

In [20]:
data[data['state']=='Alabama']

               region    state  individuals  family_members  state_pop
0  East South Central  Alabama       2570.0           864.0    4887681

In [21]:
data[data['individuals'] > 10000]

                region       state  individuals  family_members  state_pop
4              Pacific  California     109008.0         20964.0   39461588
9       South Atlantic     Florida      21443.0          9587.0   21244317
32        Mid-Atlantic    New York      39827.0         52070.0   19530351
37             Pacific      Oregon      11139.0          3337.0    4181886
43  West South Central       Texas      19199.0          6111.0   28628666
47             Pacific  Washington      16424.0          5880.0    7523869

In [22]:
data[(data['individuals']>10000)&(data['family_members']>10000)]

          region       state  individuals  family_members  state_pop
4        Pacific  California     109008.0         20964.0   39461588
32  Mid-Atlantic    New York      39827.0         52070.0   19530351

In [23]:
ind = data['individuals'] > 10000
fam = data['family_members'] > 10000

data[(ind)&(fam)]

          region       state  individuals  family_members  state_pop
4        Pacific  California     109008.0         20964.0   39461588
32  Mid-Atlantic    New York      39827.0         52070.0   19530351